app/controllers/movies_controller.rb

  def index
#@movies = Movie.all
    @all_ratings = Movie.all_ratings
    @checked = params[:ratings]
    if params[:ratings] == nil
      @checked = {}
      @all_ratings.each do |rating|
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17') ORDER BY release_date